---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricationProductEntry
source: html/ed1f3323-bf4f-2995-65c6-a69fa8d0c094.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricationProductEntry Property

"Product Entry"

## Syntax (C#)
```csharp
public static ForgeTypeId FabricationProductEntry { get; }
```